cavity/cavity/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
400
(
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
20
(
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
(0 0 0 400 0 0 0 0 0)
)
;
    }
    fixedWalls
    {
        type            extrapolatedCalculated;
        value           nonuniform List<tensor> 
60
(
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
(0 0 0 0 0 0 0 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
