cavity/cavity/system/getLine
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. A specified number of graph points are used, distributed
    uniformly along the line.

\*---------------------------------------------------------------------------*/

// start           (0 0.5 0.05);
// end             (1 0.5 0.05);
// nPoints         100;
//
// fields          (U.component(vector::X));
//
// axis            y;

#includeEtc "caseDicts/postProcessing/graphs/graphUniform.cfg"

// ************************************************************************* //
